5

**Pandas** **Library**

pandas is a software library written for the Python programming language for data manipulation and analysis

In [ ]:
import pandas as pd

In [3]:
#df = pd.read_csv('E:\Codes\input data.csv')
from google.colab import files
import pandas as pd
uploaded = files.upload()
import io 
df = pd.read_csv(io.BytesIO(uploaded['train3.csv']))
df.head(5)

Saving train3.csv to train3 (1).csv

   Loan_ID  Gender  Married  ...  Credit_History  Property_Area  Loan_Status
0        0       1        0  ...             1.0              2            1
1        1       1        1  ...             1.0              0            0
2        2       1        1  ...             1.0              2            1
3        3       1        1  ...             1.0              2            1
4        4       1        0  ...             1.0              2            1

[5 rows x 13 columns]

In [4]:
df.tail(3)

     Loan_ID  Gender  Married  ...  Credit_History  Property_Area  Loan_Status
611      611       1        1  ...             1.0              2            1
612      612       1        1  ...             1.0              2            1
613      613       0        0  ...             0.0              1            0

[3 rows x 13 columns]

In [11]:
df.shape[1]

13

In [17]:
a = df.values
len(a)

614

In [14]:
df.Loan_Status

0      1
1      0
2      1
3      1
4      1
      ..
609    1
610    1
611    1
612    1
613    0
Name: Loan_Status, Length: 614, dtype: int64

In [ ]:
df['Education']

0      0
1      0
2      0
3      1
4      0
      ..
609    0
610    0
611    0
612    0
613    0
Name: Education, Length: 614, dtype: int64

In [ ]:
df.LoanAmount

0      146.412162
1      128.000000
2       66.000000
3      120.000000
4      141.000000
          ...
609     71.000000
610     40.000000
611    253.000000
612    187.000000
613    133.000000
Name: LoanAmount, Length: 614, dtype: float64

In [ ]:
df['LoanAmount']

0      146.412162
1      128.000000
2       66.000000
3      120.000000
4      141.000000
          ...
609     71.000000
610     40.000000
611    253.000000
612    187.000000
613    133.000000
Name: LoanAmount, Length: 614, dtype: float64

In [ ]:
df.columns

Index(['Sr#', 'name  ', 'father_name', 'address', 'phonenumber', 'CGPA',
       'color', 'age', 'Depart', 'shape'],
      dtype='object')

In [ ]:
df['name  ']

0        ali
1      kinza
2    shazaib
3      adnan
4       asad
5      asman
6      kiran
7      laila
Name: name  , dtype: object

In [ ]:
li =[]
for i in df.columns:
    aa = i.strip()
    li.append(aa)
li

['Loan_ID',
 'Gender',
 'Married',
 'Dependents',
 'Education',
 'Self_Employed',
 'ApplicantIncome',
 'CoapplicantIncome',
 'LoanAmount',
 'Loan_Amount_Term',
 'Credit_History',
 'Property_Area',
 'Loan_Status']

In [ ]:
df.columns = li

In [ ]:
df.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [ ]:
df

     Loan_ID  Gender  Married  ...  Credit_History  Property_Area  Loan_Status
0          0       1        0  ...             1.0              2            1
1          1       1        1  ...             1.0              0            0
2          2       1        1  ...             1.0              2            1
3          3       1        1  ...             1.0              2            1
4          4       1        0  ...             1.0              2            1
..       ...     ...      ...  ...             ...            ...          ...
609      609       0        0  ...             1.0              0            1
610      610       1        1  ...             1.0              0            1
611      611       1        1  ...             1.0              2            1
612      612       1        1  ...             1.0              2            1
613      613       0        0  ...             0.0              1            0

[614 rows x 13 columns]

In [20]:
df.loc[0]

Loan_ID                 0.000000
Gender                  1.000000
Married                 0.000000
Dependents              0.000000
Education               0.000000
Self_Employed           0.000000
ApplicantIncome      5849.000000
CoapplicantIncome       0.000000
LoanAmount            146.412162
Loan_Amount_Term      360.000000
Credit_History          1.000000
Property_Area           2.000000
Loan_Status             1.000000
Name: 0, dtype: float64

In [18]:
df.head(2)

   Loan_ID  Gender  Married  ...  Credit_History  Property_Area  Loan_Status
0        0       1        0  ...             1.0              2            1
1        1       1        1  ...             1.0              0            0

[2 rows x 13 columns]

In [22]:
df.loc[[0,1,2]]

   Loan_ID  Gender  Married  ...  Credit_History  Property_Area  Loan_Status
0        0       1        0  ...             1.0              2            1
1        1       1        1  ...             1.0              0            0
2        2       1        1  ...             1.0              2            1

[3 rows x 13 columns]

In [23]:
df.loc[0,'ApplicantIncome']

5849

In [ ]:
df.loc[4,['LoanAmount','CoapplicantIncome']]

LoanAmount           141.0
CoapplicantIncome      0.0
Name: 4, dtype: float64

In [ ]:
df.LoanAmount

0      146.412162
1      128.000000
2       66.000000
3      120.000000
4      141.000000
          ...
609     71.000000
610     40.000000
611    253.000000
612    187.000000
613    133.000000
Name: LoanAmount, Length: 614, dtype: float64

In [ ]:
df

     Loan_ID  Gender  Married  ...  Credit_History  Property_Area  Loan_Status
0          0       1        0  ...             1.0              2            1
1          1       1        1  ...             1.0              0            0
2          2       1        1  ...             1.0              2            1
3          3       1        1  ...             1.0              2            1
4          4       1        0  ...             1.0              2            1
..       ...     ...      ...  ...             ...            ...          ...
609      609       0        0  ...             1.0              0            1
610      610       1        1  ...             1.0              0            1
611      611       1        1  ...             1.0              2            1
612      612       1        1  ...             1.0              2            1
613      613       0        0  ...             0.0              1            0

[614 rows x 13 columns]

In [31]:
#df[df.columns[:4]]
col=df.columns[:4]
df[col]

     Loan_ID  Gender  Married  Dependents
0          0       1        0           0
1          1       1        1           1
2          2       1        1           0
3          3       1        1           0
4          4       1        0           0
..       ...     ...      ...         ...
609      609       0        0           0
610      610       1        1           3
611      611       1        1           1
612      612       1        1           2
613      613       0        0           0

[614 rows x 4 columns]

In [32]:
df['Education']

0      0
1      0
2      0
3      1
4      0
      ..
609    0
610    0
611    0
612    0
613    0
Name: Education, Length: 614, dtype: int64

In [28]:
#df[df.columns[:-1]]
df.columns[1:5]

Index(['Gender', 'Married', 'Dependents', 'Education'], dtype='object')

In [ ]:
df[df.columns[:4]]

     Loan_ID  Gender  Married  Dependents
0          0       1        0           0
1          1       1        1           1
2          2       1        1           0
3          3       1        1           0
4          4       1        0           0
..       ...     ...      ...         ...
609      609       0        0           0
610      610       1        1           3
611      611       1        1           1
612      612       1        1           2
613      613       0        0           0

[614 rows x 4 columns]

In [ ]:
b = df.columns[-1]
b

'Loan_Status'

In [ ]:
df[b]

0      1
1      0
2      1
3      1
4      1
      ..
609    1
610    1
611    1
612    1
613    0
Name: Loan_Status, Length: 614, dtype: int64

In [ ]:
df[df.columns[-1]]

0      1
1      0
2      1
3      1
4      1
      ..
609    1
610    1
611    1
612    1
613    0
Name: Loan_Status, Length: 614, dtype: int64

In [ ]:
df['Loan_Status']

0      1
1      0
2      1
3      1
4      1
      ..
609    1
610    1
611    1
612    1
613    0
Name: Loan_Status, Length: 614, dtype: int64

In [34]:
df[  (df['ApplicantIncome'] == 5849)]

   Loan_ID  Gender  Married  ...  Credit_History  Property_Area  Loan_Status
0        0       1        0  ...             1.0              2            1

[1 rows x 13 columns]

In [ ]:
y = 'Loan_Status'
df[y]

0      1
1      0
2      1
3      1
4      1
      ..
609    1
610    1
611    1
612    1
613    0
Name: Loan_Status, Length: 614, dtype: int64

In [36]:
df[  (df['Loan_Status'] == 0)  & (df['ApplicantIncome']>4006) ]

     Loan_ID  Gender  Married  ...  Credit_History  Property_Area  Loan_Status
1          1       1        1  ...             1.0              0            0
9          9       1        1  ...             1.0              1            0
18        18       1        1  ...             1.0              0            0
20        20       1        1  ...             0.0              2            0
30        30       1        1  ...             1.0              2            0
..       ...     ...      ...  ...             ...            ...          ...
574      574       1        1  ...             1.0              1            0
585      585       1        1  ...             1.0              0            0
591      591       1        1  ...             1.0              1            0
596      596       1        1  ...             1.0              0            0
613      613       0        0  ...             0.0              1            0

[91 rows x 13 columns]

In [41]:
cond1 = (df['Loan_Status'] == 1) 
cond2 =  (df['ApplicantIncome']>4006)

df[cond1 & cond2]

     Loan_ID  Gender  Married  ...  Credit_History  Property_Area  Loan_Status
0          0       1        0  ...             1.0              2            1
4          4       1        0  ...             1.0              2            1
5          5       1        1  ...             1.0              2            1
15        15       1        0  ...             1.0              2            1
21        21       1        1  ...             1.0              2            1
..       ...     ...      ...  ...             ...            ...          ...
602      602       1        1  ...             1.0              2            1
604      604       0        1  ...             1.0              1            1
610      610       1        1  ...             1.0              0            1
611      611       1        1  ...             1.0              2            1
612      612       1        1  ...             1.0              2            1

[188 rows x 13 columns]

In [42]:
df['Loan_Status'].unique()

array([1, 0])

In [ ]:
df.Loan_Status.unique()

array([1, 0])

In [43]:
clr = list(df.Loan_Status)
clr[:5]

[1, 0, 1, 1, 1]

In [ ]:
clr_lis =[]

for i in clr:
    if i == 1:
        clr_lis.append('approve')
    else:
        clr_lis.append('not approve')
clr_lis[:5]

['approve', 'not approve', 'approve', 'approve', 'approve']

In [ ]:
df.insert(len(df.columns),'newlabel1',clr_lis,)

In [ ]:
df

     Loan_ID  Gender  Married  ...  Loan_Status    newlabel1     newlabel
0          0       1        0  ...            1      approve      approve
1          1       1        1  ...            0  not approve  not approve
2          2       1        1  ...            1      approve      approve
3          3       1        1  ...            1      approve      approve
4          4       1        0  ...            1      approve      approve
..       ...     ...      ...  ...          ...          ...          ...
609      609       0        0  ...            1      approve      approve
610      610       1        1  ...            1      approve      approve
611      611       1        1  ...            1      approve      approve
612      612       1        1  ...            1      approve      approve
613      613       0        0  ...            0  not approve  not approve

[614 rows x 15 columns]

In [ ]:
df

     Loan_ID  Gender  Married  ...  Loan_Status    newlabel1     newlabel
0          0       1        0  ...            1      approve      approve
1          1       1        1  ...            0  not approve  not approve
2          2       1        1  ...            1      approve      approve
3          3       1        1  ...            1      approve      approve
4          4       1        0  ...            1      approve      approve
..       ...     ...      ...  ...          ...          ...          ...
609      609       0        0  ...            1      approve      approve
610      610       1        1  ...            1      approve      approve
611      611       1        1  ...            1      approve      approve
612      612       1        1  ...            1      approve      approve
613      613       0        0  ...            0  not approve  not approve

[614 rows x 15 columns]

In [ ]:
avg_age = df['ApplicantIncome'].mean()
avg_age1 = round(avg_age)
avg_age1

5403

In [ ]:
df

     Loan_ID  Gender  Married  ...  Loan_Status    newlabel1     newlabel
0          0       1        0  ...            1      approve      approve
1          1       1        1  ...            0  not approve  not approve
2          2       1        1  ...            1      approve      approve
3          3       1        1  ...            1      approve      approve
4          4       1        0  ...            1      approve      approve
..       ...     ...      ...  ...          ...          ...          ...
609      609       0        0  ...            1      approve      approve
610      610       1        1  ...            1      approve      approve
611      611       1        1  ...            1      approve      approve
612      612       1        1  ...            1      approve      approve
613      613       0        0  ...            0  not approve  not approve

[614 rows x 15 columns]

In [ ]:
df.values

array([[0, 1, 0, ..., 1, 'approve', 'approve'],
       [1, 1, 1, ..., 0, 'not approve', 'not approve'],
       [2, 1, 1, ..., 1, 'approve', 'approve'],
       ...,
       [611, 1, 1, ..., 1, 'approve', 'approve'],
       [612, 1, 1, ..., 1, 'approve', 'approve'],
       [613, 0, 0, ..., 0, 'not approve', 'not approve']], dtype=object)

In [ ]:
df.Loan_Status.value_counts()

1    422
0    192
Name: Loan_Status, dtype: int64

In [ ]:
students = {'name':['Ali Khan','Asad Umer','qazi waqas'],
          'first':['Ali','Asad','qazi'],
          'last':['Khan','Umer','waqas'],
          'age':[23,20,25]
          }

In [ ]:
dff = pd.DataFrame(students)
dff

         name first   last  age
0    Ali Khan   Ali   Khan   23
1   Asad Umer  Asad   Umer   20
2  qazi waqas  qazi  waqas   25

In [ ]:
df.drop_duplicates()

     Loan_ID  Gender  Married  ...  Loan_Status    newlabel1     newlabel
0          0       1        0  ...            1      approve      approve
1          1       1        1  ...            0  not approve  not approve
2          2       1        1  ...            1      approve      approve
3          3       1        1  ...            1      approve      approve
4          4       1        0  ...            1      approve      approve
..       ...     ...      ...  ...          ...          ...          ...
609      609       0        0  ...            1      approve      approve
610      610       1        1  ...            1      approve      approve
611      611       1        1  ...            1      approve      approve
612      612       1        1  ...            1      approve      approve
613      613       0        0  ...            0  not approve  not approve

[614 rows x 15 columns]

In [ ]:
df.drop(columns=['newlabel1'],inplace=True)

In [ ]:
df

     Loan_ID  Gender  Married  ...  Property_Area  Loan_Status     newlabel
0          0       1        0  ...              2            1      approve
1          1       1        1  ...              0            0  not approve
2          2       1        1  ...              2            1      approve
3          3       1        1  ...              2            1      approve
4          4       1        0  ...              2            1      approve
..       ...     ...      ...  ...            ...          ...          ...
609      609       0        0  ...              0            1      approve
610      610       1        1  ...              0            1      approve
611      611       1        1  ...              2            1      approve
612      612       1        1  ...              2            1      approve
613      613       0        0  ...              1            0  not approve

[614 rows x 14 columns]

Scikit,
Numpy,
Tensorflow,
scipy,
pytorch,
matplotlib